{
  "version": "https://jsonfeed.org/version/1",
  "title": "j45's Blog",
  "home_page_url": "https://www.j45.dev/blog/",
  "description": "j45's Blog",
  "author": {
    "name": "j45"
  },
  "items": [
    {
      "id": "",
      "url": "https://www.j45.dev/blog/post_javascript_no_more.html",
      "title": "JavaScript No More",
      "summary": "Some of you will be happy to hear that this blog no longer replies on JavaScript to work. The way that things work now is that everytime I push to the repo, a GitHub Action is run which runs a Go script that I wrote.\u003cbr\u003eThis Go script generates the html pages for all the blog posts using the template that I have. It also remakes the index.html page to make sure the list of blog posts there is up to date. Now that the visitor's browser doesnt run JavaScript code to load the blog content, posts should load a bit faster, but you probably wont notice this unless you are on old hardware."
    },
    {
      "id": "",
      "url": "https://www.j45.dev/blog/post_dns_over_tls.html",
      "title": "DNS over TLS",
      "summary": "This is a blog post that I have wanted to make recently, after finding very little information online about how DNS over TLS (DoT) requests are formatted. What I have learnt while researching for \u003ca href=\"https://github.com/Minetest-j45/dothole\"\u003emy project\u003c/a\u003e is that DoT requests/respones only differ from normal DNS requests in one manner.\u003cbr\u003eThis difference is that the first 2 bytes of the message are the length of the rest of the message. These two length bytes are prepended to the message which is then sent with TLS. This is mentioned in the RFC, \u003ca href=\"https://www.rfc-editor.org/rfc/rfc7858.html#section-3.3\"\u003eas seen here\u003c/a\u003e, but I didnt see this at first, leading to some errors. I hope this information is useful or atleast interesting to someone out there."
    },
    {
      "id": "",
      "url": "https://www.j45.dev/blog/post_update.html",
      "title": "Update",
      "summary": "This is just a post updating you on how I will be using this blog system in the future and the changes I have made. As you may have noticed, my website has recently gone through many UI changes, this is as a part of my scheme to revamp my website. Along with this, I plan on changing the way my blog works, I plan on it focusing more on technology, and less about me. Soon, I will make the blog more intuitive and make it have more features, such as the links and images I promised in the prior post. I will also make new posts as soon as I get some ideas."
    },
    {
      "id": "",
      "url": "https://www.j45.dev/blog/post_feeds!.html",
      "title": "Feeds!",
      "summary": "I have successfully made feeds that are automatically generated/updated when I make a new blog post (\u003ca href=\"https://www.j45.dev/blog/feed.json\"\u003eJSON feed\u003c/a\u003e and \u003ca href=\"https://www.j45.dev/blog/feed.rss\"\u003eRSS feed\u003c/a\u003e). The way this feed generation currently works is that every time that I push a new post (or when the blog posts csv file is changed) to the GitHub repo, a GitHub Action runs, which reads the blog posts csv file and then parses and converts the information it contains into feeds using \u003ca href=\"https://pkg.go.dev/github.com/gorilla/feeds\"\u003ea very cool Golang package\u003c/a\u003e that I found. I will hopefully soon add some features such as links and images to make posts easier on the eyes."
    },
    {
      "id": "",
      "url": "https://www.j45.dev/blog/post_blog_working.html",
      "title": "Blog Working",
      "summary": "I am happy that this basic blogging system is now working. I will briefly explain how everything is currently working, all the blogs (along with their date and title) are currently stored in \u003ca href=\"https://www.j45.dev/blog/blogs.csv\"\u003ea csv file\u003c/a\u003e and when someone visits this site, that file is read and the information it contains is displayed in their brower. This system does rely on client-side JavaScript however for the large majority of people, this shouldn't be an issue, as most websites also rely on it. To make a new blog post, I add a new line to the bottom of the csv file which contains all the information about the post."
    },
    {
      "id": "",
      "url": "https://www.j45.dev/blog/post_hello_world!.html",
      "title": "Hello World!",
      "summary": "This is my first ever blog post and is sort of just a test."
    }
  ]
}